IDENTIFICATION DIVISION.
PROGRAM-ID. AddNumbers.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Num1 PIC 9(5).
01 Num2 PIC 9(5).
01 Sum1 PIC 9(6).
01 Output-Message PIC X(80).

PROCEDURE DIVISION.
    DISPLAY "Enter the first number: ".
    ACCEPT Num1.

    DISPLAY "Enter the second number: ".
    ACCEPT Num2.

    COMPUTE Sum1 = Num1 + Num2.

    STRING "The sum of " Num1 " and " Num2 " is " Sum1 INTO Output-Message
    DISPLAY Output-Message.

    STOP RUN.

